Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: xref:deploying-to-openshift-howto.adoc[With a single step]
ja_jp: xref:deploying-to-openshift-howto.adoc[ワンステップでデプロイ]

source: xref:deploying-to-openshift-native-howto.adoc[Compiled to native executables]
ja_jp: xref:deploying-to-openshift-native-howto.adoc[ネイティブ実行可能ファイルへのコンパイル]

source: xref:deploying-to-openshift-s2i-howto.adoc[By using a Source-to-Image (S2I) strategy]
ja_jp: xref:deploying-to-openshift-s2i-howto.adoc[By using a Source-to-Image (S2I) ストラテジーを使用したデプロイ]

source: xref:deploying-to-openshift.adoc[Deploying {project-name} applications to {openshift}]
ja_jp: xref:deploying-to-openshift.adoc[ {project-name} のアプリケーションを {openshift} にデプロイ]

source: xref:dev-services.adoc[Dev services overview]
ja_jp: xref:dev-services.adoc[Dev Service の概要]

source: xref:dev-services.adoc[Quarkus Dev Services] automatically provisions unconfigured services in development and test mode. Most extensions providing connectivity to services also provide dev services implementation using https://www.testcontainers.org/[Testcontainers] behind the scenes. Each dev service has some default configuration, such as the container image to use, but is limited in terms of customization.
ja_jp: xref:dev-services.adoc[Quarkus Dev Services] は、開発モードおよびテストモードで未構成のサービスを自動的にプロビジョニングします。サービスへの接続を提供するほとんどのエクステンションは、舞台裏で https://www.testcontainers.org/[Testcontainers] を使用して dev services の実装も提供します。各 dev service には、使用するコンテナーイメージなどのデフォルト設定がありますが、カスタマイズの点で制限があります。

source: xref:dev-ui-v2.adoc[Quarkus Dev UI] to learn how to support the Dev UI in your extension
ja_jp: エクステンションでDev UIをサポートする方法を xref:dev-ui-v2.adoc[Quarkus Dev UI] で学ぶ

source: xref:dev-ui.adoc[Quarkus Dev UI] to learn how to support the Dev UI in your extension
ja_jp: エクステンションでDev UIをサポートする方法を知る: link:dev-ui.html[Quarkus Dev UI]

source: xref:doc-concept.adoc[Quarkus documentation content types]
ja_jp: link:doc-concept.html[Quarkusドキュメントのコンテンツタイプ]

source: xref:doc-concepts.adoc[Quarkus documentation concepts]
ja_jp: xref:doc-concepts.adoc[Quarkusドキュメントのコンセプト]

source: xref:doc-contribute-docs-howto.adoc[Contribute to Quarkus documentation]
ja_jp: link:doc-contribute-docs-howto.html[Quarkusのドキュメントに貢献]

source: xref:doc-contribute-docs-howto.adoc[How to contribute documentation]
ja_jp: link:doc-contribute-docs-howto.html[Quarkusのドキュメントに貢献]

source: xref:doc-create-tutorial.adoc[Creating a tutorial]
ja_jp: link:doc-create-tutorial.html[チュートリアルの作成]

source: xref:doc-reference.adoc[Quarkus documentation reference]
ja_jp: xref:doc-reference.adoc[Quarkusドキュメントリファレンス]

source: xref:doc-reference.adoc[Quarkus style and content guidelines]
ja_jp: link:doc-reference.html[Quarkus スタイル・コンテンツガイドライン]

source: xref:form-auth[Form-based authentication]
ja_jp: xref:form-auth[フォームベース認証]

source: xref:funqy-gcp-functions.adoc[Funky Google Cloud Functions]: Build functions using Funqy.
ja_jp: xref:funqy-gcp-functions.adoc[Funqy Google Cloud Functions]: Funqyを使って関数を構築

source: xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding]: Build functions using Quarkus HTTP APIs: Quarkus REST (formerly RESTEasy Reactive, our Jakarta REST implementation), Undertow (Servlet), Vert.x Web, or xref:funqy-http.adoc[Funqy HTTP].
ja_jp: xref:gcp-functions-http.adoc[Google Cloud FunctionsのHTTPバインディング] ：Quarkus HTTP API：Quarkus REST（旧RESTEasy Reactive、Jakarta REST実装）、Undertow（サーブレット）、Vert.x Web、 xref:funqy-http.adoc[Funqy HTTP] を使用して関数を構築

source: xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding]: Build functions using Quarkus HTTP APIs: RESTEasy (JAX-RS), Undertow (Servlet), Vert.x Web, or xref:funqy-http.adoc[Funqy HTTP].
ja_jp: xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding]: Quarkus HTTP API: RESTEasy（JAX-RS）、Undertow（Servlet）、Vert.x Web、または link:funqy-http.html[Funqy HTTP] を使用してファンクションを構築します。

source: xref:gcp-functions-http.adoc[Google Cloud Functions HTTP binding]: Build functions using Quarkus HTTP APIs: RESTEasy Reactive (Jakarta REST), Undertow (Servlet), Vert.x Web, or xref:funqy-http.adoc[Funqy HTTP].
ja_jp: xref:gcp-functions-http.adoc[Google Cloud FunctionsのHTTPバインディング] ：Quarkus HTTP API( RESTEasy Reactive（Jakarta REST）、Undertow（Servlet）、Vert.x Web、 link:funqy-http.html[Funqy HTTP] )を使用して関数を構築します 。

source: xref:gcp-functions.adoc[Google Cloud Functions]: Build functions using the Google Cloud Functions API.
ja_jp: xref:gcp-functions.adoc[Google Cloud Functions]: Google Cloud Functions APIを使用して関数を構築

source: xref:grpc-cli.adoc[gRPC CLI support]
ja_jp: xref:grpc-cli.adoc[gRPC CLI サポート]

source: xref:grpc-generation-reference.adoc[gRPC code generation reference guide]
ja_jp: xref:grpc-generation-reference.adoc[gRPCコード生成リファレンスガイド]

source: xref:grpc-getting-started.adoc[Getting Started]
ja_jp: link:grpc-getting-started.html[はじめに]

source: xref:grpc-kubernetes.adoc[Deploying your gRPC Service in Kubernetes]
ja_jp: xref:grpc-kubernetes.adoc[KubernetesにgRPCサービスをデプロイ]

source: xref:grpc-reference.adoc[gRPC reference guide]
ja_jp: xref:grpc-reference.adoc[gRPCリファレンスガイド]

source: xref:grpc-service-consumption.adoc[Consuming a gRPC Service]
ja_jp: link:grpc-service-consumption.html[gRPCサービスの利用]

source: xref:grpc-service-implementation.adoc[Implementing a gRPC Service]
ja_jp: link:grpc-service-implementation.html[gRPCサービスの実装]

source: xref:grpc-xds.adoc[Enabling xDS gRPC support]
ja_jp: xref:grpc-xds.adoc[xDS gRPC サポートの有効化]

source: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] is used to store your user identities but you can also use xref:hibernate-orm.adoc[Hibernate ORM]. You must also add your preferred database connector library. The instructions in this example tutorial use a PostgreSQL database for the identity store.
ja_jp: ユーザー ID の保存には xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] が使用されていますが、xref:hibernate-orm.adoc[Hibernate ORM] を使用することも可能です。また、お好みのデータベースコネクタライブラリを追加する必要があります。 このチュートリアルの例では、ID ストアに PostgreSQL データベースを使用しています。

source: xref:hibernate-orm-panache.adoc[Hibernate ORM with Panache] is used to store your user identities, but you can also use xref:hibernate-orm.adoc[Hibernate ORM] with the `quarkus-security-jpa` extension.
ja_jp: xref:hibernate-orm-panache.adoc[Hibernate ORM と Panache] は、ユーザーアイデンティティーを保存するために使用されますが、 `quarkus-security-jpa` エクステンションとともに xref:hibernate-orm.adoc[Hibernate ORM] を使用することもできます。

source: xref:hibernate-orm-panache.adoc[Simplified Hibernate ORM with Panache]
ja_jp: xref:hibernate-orm-panache.adoc[PanacheでシンプルになったHibernate ORM]

source: xref:hibernate-orm.adoc#multitenancy[Hibernate ORM multitenancy]
ja_jp: xref:hibernate-orm.adoc#multitenancy[Hibernate ORM マルチテナント]

source: xref:hibernate-orm.adoc[Using Hibernate ORM and JPA]
ja_jp: xref:hibernate-orm.adoc[Hibernate ORMとJPAの使用]

source: xref:hibernate-orm.adoc[Using Hibernate ORM and Jakarta Persistence]
ja_jp: xref:hibernate-orm.adoc[Hibernate ORMとJakarta Persistenceの使用]

source: xref:how-can-i-make-my-extension-support-the-dev-ui[Custom useful bits of runtime information in the overview]
ja_jp: xref:how-can-i-make-my-extension-support-the-dev-ui[カスタムのランタイム情報の概要]

source: xref:http-reference.adoc#ssl[Secure connections with SSL/TLS]
ja_jp: xref:http-reference.adoc#ssl[SSL/TLSによるセキュアな接続]

source: xref:http-reference.adoc[Quarkus HTTP Reference]
ja_jp: xref:http-reference.adoc[Quarkus HTTPリファレンス]

source: xref:injection-of-a-configured-logger[Injecting a configured logger]
ja_jp: xref:injection-of-a-configured-logger[設定されたロガーの注入]

source: xref:inspecting-and-debugging[Inspecting and Debugging Native Executables]
ja_jp: xref:inspecting-and-debugging[ネイティブ実行可能ファイルの検査とデバッグ]

source: xref:kafka.adoc[Apache Kafka Reference Guide]
ja_jp: xref:kafka.adoc[Apache Kafka リファレンスガイド]

source: xref:logging.adoc[Quarkus logging]
ja_jp: xref:logging.adoc[Quarkus ロギング]

source: xref:mailer-reference.adoc#attachments[how to add attachments]
ja_jp: link:mailer-reference.html#attachments[添付ファイルの付け方]

source: xref:mailer-reference.adoc#gmail-specific-configuration[how to configure the mailer to send emails with GMAIL]
ja_jp: link:mailer-reference.html#gmail-specific-configuration[GMAILでメールを送信するためのメーラーの設定方法]

source: xref:mailer-reference.adoc#html[how to format the email as HTML and use inline attachments]
ja_jp: link:mailer-reference.html#html[メールをHTML形式にして、インライン添付を使用する方法]

source: xref:mailer-reference.adoc#popular[how to configure the mailer for popular email services (e.g. Gmail, AWS SES)]
ja_jp: xref:mailer-reference.adoc#popular[一般的なメールサービス（Gmail、AWS SESなど）用のメーラーの設定方法]

source: xref:mailer-reference.adoc#templates[how to use Qute templates]
ja_jp: link:mailer-reference.html#templates[Quteテンプレートの使い方]

source: xref:mailer-reference.adoc#testing[how to test applications sending emails]
ja_jp: link:mailer-reference.html#testing[電子メールを送信するアプリケーションのテスト方法]

source: xref:mailer.adoc[Sending emails using SMTP]
ja_jp: xref:mailer.adoc[SMTP を使用したメールの送信]

source: xref:micrometer.adoc[Micrometer] is the recommended approach to metrics for Quarkus. Use the SmallRye Metrics extension when it is required to retain MicroProfile specification compatibility.
ja_jp: xref:micrometer.adoc[Micrometer] が、Quarkusで推奨されるメトリクスの手法です。MicroProfile仕様との互換性を保つために必要な場合に、SmallRye Metricsエクステンションを使用して下さい。

source: xref:mongodb-panache.adoc#multitenancy[MongoDB with Panache multitenancy]
ja_jp: xref:mongodb-panache.adoc#multitenancy[Panache マルチテナント機能を備えた MongoDB]

source: xref:mutiny-primer.adoc[Mutiny - an intuitive reactive programming library]
ja_jp: xref:mutiny-primer.adoc[Mutiny -直感的なリアクティブプログラミングライブラリ]

source: xref:mutual-tls[Mutual TLS authentication]
ja_jp: xref:mutual-tls[相互TLS認証]

source: xref:native-faq[Frequently Asked Questions]
ja_jp: xref:native-faq[よくある質問]

source: xref:native-memory-management[Native Memory Management]
ja_jp: xref:native-memory-management[ネイティブメモリ管理]

source: xref:oauth2-authentication[OAuth2 authentication]
ja_jp: xref:oauth2-authentication[OAuth2認証]

source: xref:observability-devservices-lgtm.adoc[Getting Started with Grafana-OTel-LGTM]
ja_jp: xref:observability-devservices-lgtm.adoc[Grafana-OTel-LGTM 入門]

source: xref:openid-connect-authentication[OpenID Connect authentication]
ja_jp: xref:openid-connect-authentication[OpenID Connect認証]

source: xref:opentelemetry-logging.adoc[OpenTelemetry Logging Guide]
ja_jp: xref:opentelemetry-logging.adoc[OpenTelemetry Loggingガイド]

source: xref:opentelemetry-metrics.adoc[OpenTelemetry Metrics Guide]
ja_jp: xref:opentelemetry-metrics.adoc[OpenTelemetry メトリクスガイド]

source: xref:opentelemetry-tracing.adoc[OpenTelemetry Tracing Guide]
ja_jp: xref:opentelemetry-tracing.adoc[OpenTelemetry トレースガイド]

source: xref:opentelemetry.adoc#configuration-reference[OpenTelemetry configuration properties]
ja_jp: xref:opentelemetry.adoc#configuration-reference[OpenTelemetry 設定プロパティー]

source: xref:opentelemetry.adoc[OpenTelemetry] is the recommended approach to tracing and telemetry for Quarkus.
ja_jp: link:opentelemetry.html[OpenTelemetry] は、Quarkusのトレースとテレメトリーに対する推奨アプローチです。

source: xref:other-supported-authentication-mechanisms[Other supported authentication mechanisms]
ja_jp: xref:other-supported-authentication-mechanisms[その他のサポートされる認証メカニズム]

source: xref:producing-values[Build producers] to produce items for subsequent build steps
ja_jp: 後続のビルドステップのアイテムを生産する xref:producing-values[ビルドプロデューサー]

source: xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture]
ja_jp: xref:quarkus-reactive-architecture.adoc[Quarkusリアクティブアーキテクチャ]

source: xref:quarkus-reactive-architecture.adoc[The Quarkus Reactive Architecture]
ja_jp: link:quarkus-reactive-architecture.html[Quarkusリアクティブアーキテクチャ]

source: xref:quarkus-runtime-base-image.adoc[This page] explains how to extend the `quarkus-micro` image when your application has specific requirements.
ja_jp: xref:quarkus-runtime-base-image.adoc[このページ] では、アプリケーションに特定の要件がある場合に、 `quarkus-micro` イメージを拡張する方法について説明しています。

source: xref:qute-reference.adoc[Qute Reference]
ja_jp: xref:qute-reference.adoc[Qute リファレンス]

source: xref:reactive-sql-clients.adoc[Reactive SQL Clients]
ja_jp: xref:reactive-sql-clients.adoc[リアクティブ SQL クライアント]

source: xref:redis.adoc[Using the Redis Client]
ja_jp: xref:redis.adoc[Redis クライアントの使用]

source: xref:registry.quarkus.io[registry.quarkus.io] is the default registry which normally does not have to be configured explicitly, however if a user provides a custom registry list and `registry.quarkus.io` is not in it, xref:registry.quarkus.io[registry.quarkus.io] will *not* be enabled.
ja_jp: xref:registry.quarkus.io[registry.quarkus.io] は、通常、明示的に設定する必要のないデフォルトのレジストリです。ただし、ユーザーがカスタムレジストリリストを提供し、 `registry.quarkus.io` がその中にない場合、 xref:registry.quarkus.io[registry.quarkus.io] は有効化され *ません* 。

source: xref:remove_unused_beans[Unused beans removal]
ja_jp: xref:remove_unused_beans[未使用のBeanの除去]

source: xref:rest-data-panache[Secure auto-generated resources by REST Data with Panache]
ja_jp: xref:rest-data-panache[REST Data with Panacheで自動生成されたリソースを保護]

source: xref:rest-json.adoc[Expose them through REST].
ja_jp: xref:rest-json.adoc[REST で公開します] 。

source: xref:resteasy-reactive.adoc[RESTEasy Reactive]
ja_jp: link:resteasy-reactive.html[RESTEasy Reactive]

source: xref:samesite-cookies[SameSite cookies]
ja_jp: xref:samesite-cookies[SameSiteクッキー]

source: xref:secrets-engines[Secrets engines]
ja_jp: xref:secrets-engines[シークレットエンジン]

source: xref:secure-serialization[Secure serialization]
ja_jp: xref:secure-serialization[セキュアなシリアル化]

source: xref:security-architecture.adoc[Quarkus Security architecture]
ja_jp: xref:security-architecture.adoc[Quarkus Security アーキテクチャー]

source: xref:security-architecture.adoc[Quarkus Security] provides comprehensive OpenId Connect (OIDC) and OAuth2 support with its `quarkus-oidc` extension, supporting both xref:security-oidc-code-flow-authentication.adoc[Authorization code flow] and xref:security-oidc-bearer-token-authentication.adoc[Bearer token] authentication mechanisms.
ja_jp: xref:security-architecture.adoc[Quarkus Security] は、 `quarkus-oidc` エクステンションを使用して包括的な OpenId Connect (OIDC) および OAuth2 のサポートを提供し、xref:security-oidc-code-flow-authentication.adoc[認可コードフロー] と xref:security-oidc-bearer-token-authentication.adoc[ベアラートークン] の認証メカニズムをサポートします。

source: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[Combining authentication mechanisms]
ja_jp: xref:security-authentication-mechanisms.adoc#combining-authentication-mechanisms[認証メカニズムの組み合わせ]

source: xref:security-authentication-mechanisms.adoc#form-auth[Form-based authentication]
ja_jp: xref:security-authentication-mechanisms.adoc#form-auth[フォームベース認証]

source: xref:security-authentication-mechanisms.adoc#form-based-auth-programmatic-set-up[Set up Form-based authentication programmatically]
ja_jp: xref:security-authentication-mechanisms.adoc#form-based-auth-programmatic-set-up[フォームベース認証をプログラムで設定]

source: xref:security-authentication-mechanisms.adoc#mtls-programmatic-set-up[Set up the mutual TLS client authentication programmatically]
ja_jp: xref:security-authentication-mechanisms.adoc#mtls-programmatic-set-up[相互 TLS クライアント認証をプログラムで設定]

source: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[Choosing between OpenID Connect, SmallRye JWT, and OAuth2 authentication mechanisms]
ja_jp: xref:security-authentication-mechanisms.adoc#oidc-jwt-oauth2-comparison[OpenID Connect、SmallRye JWT、OAuth2の認証メカニズムの選択]

source: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Authentication mechanisms in Quarkus]
ja_jp: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Quarkusの認証メカニズム]

source: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[Other supported authentication mechanisms]
ja_jp: xref:security-authentication-mechanisms.adoc#other-supported-authentication-mechanisms[その他の認証メカニズム]

source: xref:security-authentication-mechanisms.adoc[Authentication mechanisms in Quarkus]
ja_jp: xref:security-authentication-mechanisms.adoc[Quarkusの認証メカニズム]

source: xref:security-authorization.adoc#standard-security-annotations[Standard security annotations] on CDI beans are not supported on IO thread if a non-void secured method returns a value synchronously and proactive authentication is disabled, as they need to access the `SecurityIdentity`. In the example below, we have defined `HelloResource` and `HelloService`. It's easy to see that any GET request to `/hello` will run on IO thread and throw `BlockingOperationNotAllowedException` exception. There is more than one way to fix the example:
ja_jp: CDI Beanの link:security-authorization.html#standard-security-annotations[標準的なセキュリティアノテーション] は、 `SecurityIdentity` にアクセスする必要があるため、非voidセキュアメソッドが同期的に値を返し、プロアクティブ認証が無効な場合、 IOスレッドでサポートされません。 以下の例では、 `HelloResource` と `HelloService` を定義しました。 `/hello` へのGETリクエストは、 IOスレッドで実行され、 `BlockingOperationNotAllowedException` 例外が投げられることは容易にわかります。この例を修正する方法は1つだけではありません:

source: xref:security-authorize-web-endpoints-reference.adoc[Authorization of web endpoints]
ja_jp: xref:security-authorize-web-endpoints-reference.adoc[Web エンドポイントの認可]

source: xref:security-basic-auth-concept.adoc[Basic HTTP Authentication] and xref:security-built-in-authentication.adoc#form-auth[Form HTTP authentication] are the core authentication mechanisms supported in Quarkus.
ja_jp: xref:security-basic-authentication-concept.adoc[Basic HTTP認証] と xref:security-built-in-authentication-support-concept.adoc#form-auth[Form HTTP認証] は、Quarkusでサポートされているコアな認証メカニズムです。

source: xref:security-basic-authentication-howto.adoc[Enable Basic authentication]
ja_jp: xref:security-basic-authentication-howto.adoc[Basic 認証の有効化]

source: xref:security-basic-authentication-tutorial.adoc[Secure a Quarkus application with Basic authentication and Jakarta Persistence]
ja_jp: xref:security-basic-authentication-tutorial.adoc[Basic認証とJakarta PersistenceによるQuarkusアプリケーションの保護]

source: xref:security-basic-authentication.adoc#basic-auth-programmatic-set-up[Set up Basic authentication programmatically]
ja_jp: xref:security-basic-authentication.adoc#basic-auth-programmatic-set-up[Basic 認証をプログラムで設定]

source: xref:security-basic-authentication.adoc[Basic authentication]
ja_jp: xref:security-basic-authentication.adoc[Basic 認証]

source: xref:security-basic-authentication.adoc[Basic], xref:form-auth[Form-based authentication]
ja_jp: xref:security-basic-authentication.adoc[ベーシック] 、 xref:form-auth[フォームベース認証]

source: xref:security-cors.adoc#cors-filter-programmatic-set-up[Configuring the CORS filter programmatically]
ja_jp: xref:security-cors.adoc#cors-filter-programmatic-set-up[CORS フィルターをプログラムで設定]

source: xref:security-cors.adoc#cors-filter[Cross-origin resource sharing]
ja_jp: xref:security-cors.adoc#cors-filter[クロスオリジン・リソース共有]

source: xref:security-csrf-prevention.adoc#csrf-prevention-programmatic-set-up[Configuring the CSRF prevention programmatically]
ja_jp: xref:security-csrf-prevention.adoc#csrf-prevention-programmatic-set-up[CSRF 対策をプログラムで設定]

source: xref:security-getting-started-tutorial.adoc[Getting started with Security by using Basic authentication and Jakarta Persistence]
ja_jp: xref:security-getting-started-tutorial.adoc[Basic 認証と Jakarta Persistence を使ったセキュリティー入門]

source: xref:security-getting-started.adoc[Secure a Quarkus application with Basic authentication]
ja_jp: xref:security-basic-authentication-tutorial.adoc[QuarkusアプリケーションをBasic認証で保護]

source: xref:security-identity-providers.adoc[Identity Providers]
ja_jp: xref:security-identity-providers.adoc[アイデンティティープロバイダー]

source: xref:security-identity-providers.adoc[Identity providers]
ja_jp: xref:security-identity-providers.adoc[アイデンティティープロバイダー]

source: xref:security-jdbc.adoc[Elytron security JDBC extension `(quarkus-elytron-security-jdbc)`]
ja_jp: xref:security-jdbc.adoc[Elytron セキュリティー JDBC エクステンション `(quarkus-elytron-security-jdbc)`]

source: xref:security-jdbc.adoc[Using security with JDBC]
ja_jp: xref:security-jdbc.adoc[セキュリティをJDBCと一緒に使用]

source: xref:security-jpa.adoc[Quarkus Security Jakarta Persistence extensions (`quarkus-security-jpa` or `quarkus-security-jpa-reactive`)]
ja_jp: xref:security-jpa.adoc[Quarkus セキュリティー Jakarta 永続性エクステンション (`quarkus-security-jpa` または `quarkus-security-jpa-reactive`)]

source: xref:security-jpa.adoc[Quarkus Security with Jakarta Persistence]
ja_jp: xref:security-jpa.adoc[Quarkus SecurityとJakarta Persistence]

source: xref:security-jwt-build.adoc[Sign and encrypt JWT tokens with SmallRye JWT Build]
ja_jp: xref:security-jwt-build.adoc[JSONウェブトークン (JWT) のビルド、署名、暗号化]

source: xref:security-jwt.adoc[Using SmallRye JWT to Protect Service Applications]
ja_jp: xref:security-jwt.adoc[SmallRye JWT を使用してサービスアプリケーションを保護する]

source: xref:security-jwt.adoc[Using Smallrye JWT to Protect Service Applications]
ja_jp: xref:security-jwt.adoc[Smallrye JWT を使用したサービスアプリケーションの保護]

source: xref:security-keycloak-admin-client.adoc[Quarkus Keycloak Admin Client]
ja_jp: xref:security-keycloak-admin-client.adoc[Quarkus Keycloak Adminクライアント]

source: xref:security-keycloak-admin-client.adoc[Using the Keycloak admin client]
ja_jp: xref:security-keycloak-admin-client.adoc[Keycloak admin クライアントの使用]

source: xref:security-keycloak-authorization.adoc[Keycloak Authorization extension]
ja_jp: link:security-keycloak-authorization.html[Keycloak Authorization エクステンション]

source: xref:security-keycloak-authorization.adoc[Using OpenID Connect (OIDC) and Keycloak to centralize authorization]
ja_jp: xref:security-keycloak-authorization.adoc[OpenID Connect (OIDC) と Keycloak を使用して認可を一元化]

source: xref:security-ldap.adoc[Using security with an LDAP realm]
ja_jp: xref:security-ldap.adoc[セキュリティをLDAPレルムと一緒に使用]

source: xref:security-oidc-auth0-tutorial.adoc[Protect Quarkus web application by using Auth0 OpenID Connect provider]
ja_jp: xref:security-oidc-auth0-tutorial.adoc[Auth0 OpenID Connectプロバイダーを使用したQuarkusウェブアプリケーションの保護]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OIDC Bearer token authentication]
ja_jp: xref:security-oidc-bearer-token-authentication-tutorial.adoc[OIDCベアラートークン認証によるサービスアプリケーションの保護]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OpenID Connect (OIDC) Bearer token authentication]
ja_jp: xref:security-oidc-bearer-token-authentication-tutorial.adoc[OpenID Connect（OIDC）ベアラートークン認証によるサービスアプリケーションの保護]

source: xref:security-oidc-bearer-token-authentication-tutorial.adoc[Protect a service application by using OpenID Connect (OIDC) Bearer token authentication].
ja_jp: xref:security-oidc-bearer-token-authentication-tutorial.adoc[OpenID Connect（OIDC）ベアラートークン認証によるサービスアプリケーションの保護]

source: xref:security-oidc-bearer-token-authentication.adoc#token-scopes-and-security-identity-permissions[OpenID Connect Bearer Token Scopes And SecurityIdentity Permissions]
ja_jp: xref:security-oidc-bearer-token-authentication.adoc#token-scopes-and-security-identity-permissions[OpenID Connect ベアラートークンの範囲と SecurityIdentity 権限]

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication]
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証]

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication], xref:security-jwt.adoc[JWT] , xref:security-oauth2.adoc[OAuth2]
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラートークン認証]、xref:security-jwt.adoc[JWT]、xref:security-oauth2.adoc[OAuth2]

source: xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication], xref:security-jwt.adoc[JWT], xref:security-oauth2.adoc[OAuth2]
ja_jp: xref:security-oidc-bearer-token-authentication.adoc[OIDCベアラートークン認証] 、 xref:security-jwt.adoc[JWT] 、 xref:security-oauth2.adoc[OAuth2]
